var searchData=
[
  ['макросы_20для_20генерации_20сишных_20функций_20_28в_20c_20нет_20полиморфиза_20и_20поэтому_20некоторые_20функции_20перегружены_20по_20именам_2c_20а_20не_20по_20аргументам_2c_20как_20например_3a_20gluniform_28разные_20постфиксы_29_2e_20Здесь_20прсдетавлено_20решение_20данной_20проблемы_21_29',['макросы для генерации сишных функций (в C нет полиморфиза и поэтому некоторые функции перегружены по именам, а не по аргументам, как например: glUniform(разные постфиксы). Здесь прсдетавлено решение данной проблемы!)',['../group___auto_func_generator.html',1,'']]],
  ['Ошибки',['Ошибки',['../bug.html',1,'']]],
  ['Сеттеры_20для_20построения_20интерфейса_20приложения',['Сеттеры для построения интерфейса приложения',['../group___set_methods_of_interface.html',1,'']]]
];
